test_cases/spalart_allmaras/transient/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.19016e-6;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    Jet 
    {
        type            calculated; 
        value           $internalField; 
    }

    wallPreInlet
    {
        type            nutSlip; // needs to be dicussed
        value           $internalField;
    }

    upperWall
    {
        type            nutUSpaldingWallFunction;  //nutkWallFunction; - caculated nut depending on k, nutUSpaldingWallFunction depending on U 
        value           $internalField;
    }

    lowerWall
    {
        type            nutUSpaldingWallFunction;  //nutkWallFunction; - caculated nut depending on k, nutUSpaldingWallFunction depending on U 
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
